# Day 25 Assignment - Hitik Panchal

In [41]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.naive_bayes import *

# Reading the Data

In [65]:
data = pd.read_csv('train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [67]:
data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked       False
dtype: bool

# Converting the Data

In [23]:
data['Age'].mean()

32.69985376827896

In [24]:
data['Age'] = np.where(data['Age'].isnull(),32,data['Age'])

In [25]:
label_encoder = preprocessing.LabelEncoder()

In [26]:
data['Sex'] = label_encoder.fit_transform(data['Sex'])

In [35]:
data['Embarked'] = label_encoder.fit_transform(data['Embarked'])

In [36]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [39]:
data.drop(["PassengerId","Name","Ticket","Cabin"],axis = 1,inplace = True)

In [40]:
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

# Function for finding the Accuracy and Confusion Matrix

In [54]:
def conf_matrix(ydata):
    y = data[ydata]
    X = data.drop([ydata], axis = 1)
    X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.3,random_state = 0)
    clf = BernoulliNB()
    y_pred = clf.fit(X_train, y_train).predict(X_test)
    print("The Accuracy Score for "+ydata+" is : ",accuracy_score(y_test, y_pred, normalize = True))
    print()
    print("The Confusion Matrix for "+ydata+" is : ")
    print(confusion_matrix(y_test, y_pred))

# Finding the Accuracy Score and Confusion Matrix for different Dependent Variables

### DV : Survived , IDV : Remaining

In [61]:
conf_matrix("Survived")

The Accuracy Score for Survived is :  0.7715355805243446

The Confusion Matrix for Survived is :
[[131  26]
 [ 35  75]]

### DV : Pclass , IDV : Remaining

In [62]:
conf_matrix("Pclass")

The Accuracy Score for Pclass is :  0.5917602996254682

The Confusion Matrix for Pclass is :
[[ 30   8  32]
 [  9  10  30]
 [ 24   6 118]]

### DV : Gender , IDV : Remaining

In [63]:
conf_matrix("Sex")

The Accuracy Score for Sex is :  0.7453183520599251

The Confusion Matrix for Sex is :
[[ 49  49]
 [ 19 150]]

### DV : SibSp , IDV : Remaining

In [64]:
conf_matrix("SibSp")

The Accuracy Score for SibSp is :  0.6891385767790262

The Confusion Matrix for SibSp is :
[[162  20   0   0   0   0   0]
 [ 43  22   0   0   0   0   0]
 [  6   2   0   0   0   0   0]
 [  5   2   0   0   0   0   0]
 [  2   0   0   0   0   0   0]
 [  1   0   0   0   0   0   0]
 [  2   0   0   0   0   0   0]]

### DV : Parch , IDV : Remaining

In [59]:
conf_matrix("Parch")

The Accuracy Score for Parch is :  0.7153558052434457

The Confusion Matrix for Parch is :
[[182  16   0   0   0]
 [ 31   9   0   0   0]
 [ 24   3   0   0   0]
 [  1   0   0   0   0]
 [  1   0   0   0   0]]

### DV : Embarked , IDV : Remaining

In [60]:
conf_matrix("Embarked")

The Accuracy Score for Embarked is :  0.7340823970037453

The Confusion Matrix for Embarked is :
[[  0   0  49]
 [  0   0  22]
 [  0   0 196]]